# ElementWorksetFilter Constructor (WorksetId, Boolean)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ElementWorksetFilter Constructor (WorksetId, Boolean)
ElementWorksetFilter Class See Also
---
Constructs a new instance of a filter to match elements in a given workset.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public ElementWorksetFilter(
	WorksetId worksetId,
	bool inverted
)
```

Visual Basic
---
```text
Public Sub New ( _
	worksetId As WorksetId, _
	inverted As Boolean _
)
```

Visual C++
---
```text
public:
ElementWorksetFilter(
	WorksetId^ worksetId,
	bool inverted
)
```

# ### Parameters
worksetId
    Type: Autodesk.Revit.DB..::..WorksetId The workset id to match.
inverted
    Type: System..::..Boolean True if the filter should match all elements which are not in the given workset.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
ElementWorksetFilter Class
ElementWorksetFilter Overload
Autodesk.Revit.DB Namespace